Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Sometimes it is useful to prevent this, either to change the nature of the match, or to cause it fail earlier than it otherwise might, when the author of the pattern knows there is no point in carrying on.
es: Ésta es una extensión comparada con Perl 5.005, la cualÉsta es una extensión comparada con Perl 5.005, la cual requiere que todas las opciones a casar tengan la misma longitud.

source: Once-only subpatterns provide the means for specifying that once a portion of the pattern has matched, it is not to be re-evaluated in this way, so the matcher would give up immediately on failing to match "foo"Once-only subpatterns provide the means for specifying that once a portion of the pattern has matched, it is not to be re-evaluated in this way, so the matcher would give up immediately on failing to match "foo" the first time.
es: Una sentencia como (? =ab(c_BAR_de)) no es permitida, ya que sus opciones a nivel superior pueden casar dos longitudes diferentes, pero es aceptable si se rescribe para usar dos opciones a nivel superior: (? =abc_BAR_abde) La implementación de sentencias de punto actual es, para cada alternativa, mover temporalmente la posición actual hacia atrás por la longitud fijadaUna sentencia como (? =ab(c_BAR_de)) no es permitida, ya que sus opciones a nivel superior pueden casar dos longitudes diferentes, pero es aceptable si se rescribe para usar dos opciones a nivel superior: (? =abc_BAR_abde) La implementación de sentencias de punto actual es, para cada alternativa, mover temporalmente la posición actual hacia atrás por la longitud fijada e intentar casar.

source: The notation is another kind of special parenthesis, starting with (? as in this example: (? \d+)bar This kind of parenthesis "locks up "the part of the pattern it contains once it has matched, and a failure further intoThe notation is another kind of special parenthesis, starting with (? as in this example: (? \d+)bar This kind of parenthesis "locks up" the part of the pattern it contains once it has matched, and a failure further into the pattern is prevented from backtracking into it.
es: Las sentencias de punto actual en unión con subpatrones de sólo una vez pueden ser particularmente útiles para emparejamientos de finales de cadenas; un ejemplo es dado al final de la sección sobre subpatrones de una sola vez.

source: Back - tracking past it to previous items, however, works as normal.
es: Varias sentencias (de cualquier tipo) pueden suceder consecutivamente.

source: An alternative description is that a subpattern of this type matches the string of characters that an identical standalone pattern would match, if anchored at the current point in the subject string.
es: Por ejemplo, (? =\d{3})(? !999)foo empareja "foo "precedido por tres dígitos que no sean "999".

source: Once-only subpatterns are not capturing subpatterns.
es: Además, las sentencias puede ser anidadas en cualquier combinación.

source: Simple cases such as the above example can be thought of as a maximizingSimple cases such as the above example can be thought of as a maximizing repeat that must swallow everything it can.
es: Por ejemplo, (? =(? !foo)bar)baz empareja una ocurrencia de "baz "que es precedida por "bar" la cual no sea precedida por "foo ".

source: So, while both \d + and \d+? are prepared to adjust the number of digits they match in order to make the rest of the pattern match, (? \d+) can only match an entire sequence of digits.
es: Los subpatrones de sentencias no son subpatrones capturados, y no puedenLos subpatrones de sentencias no son subpatrones capturados, y no pueden ser repetidos, ya que no tiene sentido la misma cosa varias veces.

source: Once-only subpatterns can be used in conjunction with look - behind assertions to specify efficient matching at the endOnce-only subpatterns can be used in conjunction with look - behind assertions to specify efficient matching at the end of the subject string.
es: Si una sentencia contiene subpatrones capturados dentro de ella, éstos son siempre contados para el propósito de la numeración de los subpatrones capturadosSi una sentencia contiene subpatrones capturados dentro de ella, éstos son siempre contados para el propósito de la numeración de los subpatrones capturados en todo el patrón.

source: Consider a simple pattern such as abcd$Consider a simple pattern such as abcd$ when applied to a long string which does not match.
es: Las subcadenas capturadas son tenidas en cuenta para las sentencias afirmativas, pero no para las negativas (no tiene sentido).

source: If the pattern is specified as ^.*abcd$ then the initial .* matches the entire string at first, but when this fails (because there is no following "a"), it backtracks to match all but the last character, then all butIf the pattern is specified as ^.*abcd$ then the initial .* matches the entire string at first, but when this fails (because there is no following "a"), it backtracks to match all but the last character, then all but the last two characters, and so on.
es: El contador de sentencias llega hasta un máximo de doscientos subpatrones con paréntesis.

source: However, if the pattern is written as ^(? .*)(? =abcd) then there can be no backtracking for the .* item; it canHowever, if the pattern is written as ^(? .*)(? =abcd) then there can be no backtracking for the .* item; it can match only the entire string.
es: SUBPATRONES DE UNA SOLA VEZ Maximizando y minimizando las repeticiones para ver si un número diferente de éstas permite al resto del patrón emparejar, causa múltiples evaluacionesSUBPATRONES DE UNA SOLA VEZ Maximizando y minimizando las repeticiones para ver si un número diferente de éstas permite al resto del patrón emparejar, causa múltiples evaluaciones de la cadena de entrada.

source: IfIf it fails, the match fails immediately.
es: A veces es útil prevenir esto, cambiando el patrón o provocando que la repetición falle pronto, cuando el creador del patrón conoce que no hay puntos en común.

source: When a pattern contains an unlimited repeat inside a subpattern that can itself be repeated an unlimited number of times, the use of a once-only subpattern is the only way to avoid some failing matches taking a very long time indeed.
es: Considera, por ejemplo, el patrón \d+foo cuando se aplica a esta cadena de entrada 123456bar Después de emparejar los seis dígitos falla al emparejar "foo", la acción normal del casamiento es intentar otra vez con sólo cinco dígitos que emparejen con el elemento \d+, y entonces con cuatro, y así, antes de fallar.

source: When it matches, it runs quickly.
es: Subpatrones de una sola vez dan el modo de especificar que una parte del patrón tiene que emparejar, no es re-evaluado de esta manera, así elSubpatrones de una sola vez dan el modo de especificar que una parte del patrón tiene que emparejar, no es re-evaluado de esta manera, así el casamiento fallará al emparejar "foo" la primera vez.

source: However, if it is applied to aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaHowever, if it is applied to aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa it takes a long time before reporting failure.
es: La notación es otra clase de paréntesis especial, iniciado con (?gt; como en este ejemplo: (? \d+)bar Esta clase de paréntesis "bloquean "la parte del patrón que tiene que ser emparejada una vez y un fallo impide que la re-evalue.

source: They remember the last single character that is required for a match, and fail early if it is not present in the string.) If the pattern is changed to ((? \D+) _BAR_ \d + )*[!?] sequences of non-digits cannot be broken, and failure happens quickly.
es: Una descripción alternativa es que un subpatrón de este tipo case los caracteres de la cadena que un patrón fijo emparejaría, si estuviera anclado en el punto actual de la cadena de entrada.

source: The two possible forms of conditional subpattern are (?(condition)yes-pattern) (?(condition)yes-pattern_BAR_no-pattern) If the condition is satisfied, the yes-pattern is used; otherwiseThe two possible forms of conditional subpattern are (?(condition)yes-pattern) (?(condition)yes-pattern_BAR_no-pattern) If the condition is satisfied, the yes-pattern is used; otherwise the no-pattern (if present) is used.
es: Subpatrones de una sola vez no son subpatrones capturados.

source: There are two kinds of condition.
es: Estos casos tal como el ejemplo anterior pueden ser interpretado como de una repetición maximizada que debe tragar todo lo que pueda.

source: Consider the following pattern, which contains non-significant white space to make it more readable (assume the PCRE_EXTENDED option) and to divide it into three parts for ease of discussion: (\ ()? [^()] + (?(1)\)) The first part matches an optional opening parenthesis, and if that character is present, sets it as the first capturedConsider the following pattern, which contains non-significant white space to make it more readable (assume the PCRE_EXTENDED option) and to divide it into three parts for ease of discussion: (\ ()? [^()] + (?(1)\)) The first part matches an optional opening parenthesis, and if that character is present, sets it as the first captured substring.
es: Por esto, mientras ambos \d + y \d? están preparados para ajustar el número de dígitos que emparejan para hacer que el resto del patrón case, (? \d+) sólo puede emparejar un secuencia de dígitos entera.

source: The second part matches one or more charactersThe second part matches one or more characters that are not parentheses.
es: Esta construcción, por supuesto, puede contener subpatrones arbitriamente complicados y pueden estar anidados.

source: The third part is a conditional subpattern that tests whether the first set of parenthesesThe third part is a conditional subpattern that tests whether the first set of parentheses matched or not.
es: Subpatrones de una sola vez pueden usarse con sentencias de punto actual para especificar eficientes emparejamientos al final de la cadena de entrada.

source: Otherwise, since no-pattern is not present, theOtherwise, since no-pattern is not present, the subpattern matches nothing.
es: Consideremos un patrón sencillo como este abcd$Consideremos un patrón sencillo como este abcd$ cuando se aplica a una cadena larga con la cual no empareja.

source: If the condition is not a sequence of digits, it must be anIf the condition is not a sequence of digits, it must be an assertion.
es: Ya que el casamiento va de izquierda a derecha, PCRE buscará cada "a" en la cadenaYa que el casamiento va de izquierda a derecha, PCRE buscará cada "a "en la cadena y entonces verá si lo que sigue casa con el resto del patrón.

source: Consider this pattern, again containing non-significant white space, and with the two alternatives on the second line: (?(?=[^a-z]*[a-z]) \d{2} -[a-z]{3}-\d{2} _BAR_ \d{2}-\d{2}-\d{2}) The condition is a positive lookahead assertion that matchesConsider this pattern, again containing non-significant white space, and with the two alternatives on the second line: (?(?=[^a-z]*[a-z]) \d{2} -[a-z]{3}-\d{2} _BAR_ \d{2}-\d{2}-\d{2}) The condition is a positive lookahead assertion that matches an optional sequence of non-letters followed by a letter.
es: Otra vez la búsqueda de "a" cubre laOtra vez la búsqueda de "a "cubre la cadena completa, de derecha a izquierda, de esta manera no se mejora.

source: If a letter is found, the subject is matched against the first alternative; otherwise it isIf a letter is found, the subject is matched against the first alternative; otherwise it is matched against the second.
es: Sin embargo, si el patrón fuese este ^(? .*)(? =abcd) entonces no hay vuelta atrás para el elemento .*; sólo puede casar la cadenaSin embargo, si el patrón fuese este ^(? .*)(? =abcd) entonces no hay vuelta atrás para el elemento .*; sólo puede casar la cadena entera.

source: This pattern matches strings in one of the two forms dd-aaa-dd or dd-dd-dd, where aaa are letters and dd are digits.
es: La sentencia de punto actual subsiguiente hace un test sencilloLa sentencia de punto actual subsiguiente hace un test sencillo sobre los últimos cuatro caracteres.

source: NestedNested parentheses are not permitted.
es: Para cadena largas, este acercamiento da una diferencia significativa en tiempo de ejecución.

source: If the PCRE_EXTENDED option is set, an unescaped # character outside a character class introduces a comment that contin - ues up to the next newline character in the pattern.
es: SUBPATRONES CONDICIONALES Es posible hacer que el casamiento procese un subpatrón condicionalmente o elegir entre dos subpatrones alternativos, dependiendo del resultado de una sentencia o si un subpatrón capturado previamente casó o no.

source: Without the use of recursion, the best that can be done is to use a patternWithout the use of recursion, the best that can be done is to use a pattern that matches up to some fixed depth of nesting.
es: Las dos formas posibles de subpatrones condicionales son (?(condition)yes-pattern) (?(condition)yes-pattern_BAR_no-pattern) Si la condición es satisfecha, el yes-pattern es usado; sino el no-patternLas dos formas posibles de subpatrones condicionales son (?(condition)yes-pattern) (?(condition)yes-pattern_BAR_no-pattern) Si la condición es satisfecha, el yes-pattern es usado; sino el no-pattern es utilizado si existe.

source: It is notIt is not possible to handle an arbitrary nesting depth.
es: Si hay más de dos alternativas en el subpatrón, se produce un error en tiempo de compilación.

source: The special The special item (?R) is provided for the specific case of recursion.
es: Si el texto entre los paréntesis consiste de una secuencia de dígitos, entonces la condición es verdadera si elSi el texto entre los paréntesis consiste de una secuencia de dígitos, entonces la condición es verdadera si el subpatrón capturado de ese número ha sido casado previamente.

source: Then it matches any number of substrings which can either be a sequence of non - parentheses, or a recursive match of the pattern itselfThen it matches any number of substrings which can either be a sequence of non - parentheses, or a recursive match of the pattern itself (i.e. a correctly parenthesized substring).
es: Consideremos el siguiente patrón, contiene espacios en blanco para hacerlo más leíble (asumimos la opción PCRE_EXTENDED) y lo dividimos en tres partes para facilitar la discusión: (\ ()? [^()] + (?(1)\)) La primera parte empareja un paréntesis opcional abierto, y si el carácterConsideremos el siguiente patrón, contiene espacios en blanco para hacerlo más leíble (asumimos la opción PCRE_EXTENDED) y lo dividimos en tres partes para facilitar la discusión: (\ ()? [^()] + (?(1)\)) La primera parte empareja un paréntesis opcional abierto, y si el carácter esta presente, lo define como la primera subcadena capturada.

source: This particular example pattern contains nested unlimited repeats, and so the use of a once-only subpattern for matching strings of non-parentheses is important when applyingThis particular example pattern contains nested unlimited repeats, and so the use of a once-only subpattern for matching strings of non-parentheses is important when applying the pattern to strings that do not match.
es: La tercera parte es un subpatrón condicional que examina si el primer conjunto deLa tercera parte es un subpatrón condicional que examina si el primer conjunto de paréntesis casa o no.

source: However, if a once-only subpattern is not used, the match runs for a very long time indeed because there are so many different ways the + and * repeats can carve up the subject, and all have to be tested before failure can be reported.
es: Si fuera así, esto es, si la cadena de entrada empieza por un paréntesis abierto, la condición es cierta, y el yes-patternSi fuera así, esto es, si la cadena de entrada empieza por un paréntesis abierto, la condición es cierta, y el yes-pattern es ejecutado y un paréntesis de cierre es requerido.

source: The values set for any capturing subpatterns are those from the outermost level of the recursion at which the subpatternThe values set for any capturing subpatterns are those from the outermost level of the recursion at which the subpattern value is set.
es: En otras palabras, este patrón casa una secuencia de datos sin paréntesis opcionalmente limitada por ellos.

source: If the pattern above is matched against (ab(cd)ef) the value for the capturing parentheses is "ef", which isIf the pattern above is matched against (ab(cd)ef) the value for the capturing parentheses is "ef ", which is the last value taken on at the top level.
es: Esto puede ser una sentencia de más adelante positiva o negativa o unaEsto puede ser una sentencia de más adelante positiva o negativa o una de punto actual.

source: If there are more than 15 capturing parentheses in a pattern, PCRE has to obtain extra memory to store data during a recursion, which it does by using pcre_malloc, freeing itIf there are more than 15 capturing parentheses in a pattern, PCRE has to obtain extra memory to store data during a recursion, which it does by using pcre_malloc, freeing it via pcre_free afterwards.
es: En otras palabras, examina la presencia de al menos una letra en la cadenaEn otras palabras, examina la presencia de al menos una letra en la cadena de entrada.

source: If no memory can be obtained, it saves data for the first 15 capturing parentheses only, as there is no way to give an out-of-memory error from within a recursion.
es: Si una letra es encontrada, la cadena es casada con la primeraSi una letra es encontrada, la cadena es casada con la primera alternativa; sino lo es con la segunda.

source: Certain items that may appear in patterns are more efficientCertain items that may appear in patterns are more efficient than others.
es: Este patrón casa cadenas de una de estas dos formas dd-aaa-dd o dd-dd-dd, donde aaa son letra y dd son dígitos.

source: In general, the simplest construction that provides theIn general, the simplest construction that provides the required behaviour is usually the most efficient.
es: COMENTARIOS La secuencia (?# marca el inicio de un comentario el cual continua hastaCOMENTARIOS La secuencia (?# marca el inicio de un comentario el cual continua hasta el primer paréntesis.

source: Jeffrey Friedl 's book contains a lot of discussion about optimizing regular expressions for efficient performance.
es: Los paréntesis anidados no son permitidos.

source: However, if PCRE_DOTALL is not set, PCRE cannot make this optimization, because the. metacharacter does not then match a newline, and if the subject string contains newlines, the pattern may match from the character immediately following one of themHowever, if PCRE_DOTALL is not set, PCRE cannot make this optimization, because the. metacharacter does not then match a newline, and if the subject string contains newlines, the pattern may match from the character immediately following one of them instead of from the very start.
es: Los caracteres que forman un comentario no forman parte del patrón de emparejamiento.

source: In order to do this, PCRE has to retry the match starting after every newline in the subject.
es: RENDIMIENTO Ciertos elementos que pueden aparecer en los patrones son más eficientesRENDIMIENTO Ciertos elementos que pueden aparecer en los patrones son más eficientes que otros.

source: If you are using such a pattern with subject strings that do not contain newlines, the best performance is obtained by setting PCRE_DOTALL, or starting the pattern with ^.* toIf you are using such a pattern with subject strings that do not contain newlines, the best performance is obtained by setting PCRE_DOTALL, or starting the pattern with ^.* to indicate explicit anchoring.
es: En general, los constructores más sencillos que dan la conducta requerida son, normalmente, más eficientes.

source: That saves PCRE from having to scan along the subject looking for a newline to restart at.
es: El libro de Jeffrey Friedl contiene un montón de discusiones sobre la optimización de expresiones regulares para un rendimiento eficiente.

source: These can take a long time to run when applied to a stringThese can take a long time to run when applied to a string that does not match.
es: Cuando un patrón empieza con .* y la opción PCRE_DOTALL está definida, el patrón es anclado implícitamente por PCRE, ya que sólo puede casar el inicioCuando un patrón empieza con .* y la opción PCRE_DOTALL está definida, el patrón es anclado implícitamente por PCRE, ya que sólo puede casar el inicio de la cadena de entrada.

source: An optimization catches some of the more simple cases such as (a+)*bAn optimization catches some of the more simple cases such as (a+ )*b where a literal character follows.
es: Sin embargo, si PCRE_DOTALL no es definido, PCRE no puede hacer esta optimización, ya que el meta carácter. no tiene porque casar con una nueva línea y si la cadena de entrada contiene varias nuevas líneas, el patrón puede emparejar desde el carácter inmediatamente siguienteSin embargo, si PCRE_DOTALL no es definido, PCRE no puede hacer esta optimización, ya que el meta carácter. no tiene porque casar con una nueva línea y si la cadena de entrada contiene varias nuevas líneas, el patrón puede emparejar desde el carácter inmediatamente siguiente a uno de ellos en vez del inicio.

source: Before embarking on the standard matching procedure, PCRE checks that there is a "b" later in the subject string, and if there is not, it failsBefore embarking on the standard matching procedure, PCRE checks that there is a "b "later in the subject string, and if there is not, it fails the match immediately.
es: En otras palabras, PCRE tiene que intentar los casamientos iniciándolos después de cada nueva línea en la cadena de entrada.

source: You can see the difference by comparing the behaviour of (a+)*\dYou can see the difference by comparing the behaviour of (a+ )*\d with the pattern above.
es: Si estas usando un patrón con cadenas de entrada que no contienen nuevas líneas, el mejor rendimiento se obtiene definiendo PCRE_DOTALL o iniciandoSi estas usando un patrón con cadenas de entrada que no contienen nuevas líneas, el mejor rendimiento se obtiene definiendo PCRE_DOTALL o iniciando el patrón con ^.* para indicar anclamiento explícito.

source: The former gives a failure almost instantly when applied to a whole line of "a" characters, whereas the latter takes an appreciable time with strings longer than about 20 characters.
es: Esto previene a PCRE tener que examinar toda la cadena de entrada buscando nuevas líneas para empezar de nuevo.

source: Pattern Modifiers
es: Modificadores de Patrones

source: To report errors from an internal function, you should call the php3_error() function.
es: Para informar de errores desde una función interna, deberá llamar la función php3_error().

source: The error levels are:
es: Esta lleva al menos dos parámetros: el primero el es nivel del error, y el segundo es la cadena de formato para el mensaje de error (como en una llamada estándar a printf()).

source: Notices are not printed by default, and indicate that the script encountered something that could indicate an error, but could also happen in the normal course of running a script.
es: Los niveles de error son:

source: Warnings are printed by default, but do not interrupt script execution.
es: Por defecto se visualizan las noticas, e indican que el guión encontró algo que podría indicar un error, pero que también podría ocurrir durante el curso normal de la ejecución del mismo.

source: For example, calling ereg() with an invalid regular expression.
es: Por ejemplo, al intentar acceder al valor de una variable que no ha sido fijado, o llamar a stat() sobre un fichero que no existe.
